АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыГТО/алк_ВыгрузкаИзКамерыГТО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВыгрузкаИзКамерыГТО</name>
  <basedOn>Document.алк_ЗагрузкаВКамеруГТО</basedOn>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <attributes>
    <name>ДатаНачалаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияВыгрузкиНорматив</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.алк_ЗагрузкаВКамеруГТО</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.Бригады</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Камера</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>Градация</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_РапортПропарка/алк_РапортПропарка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РапортПропарка</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиКамерыГТО</registerRecords>
  <registerRecords>InformationRegister.алк_ВремяПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_УчетВремениПропарки</registerRecords>
  <registerRecords>InformationRegister.алк_СтатусПропарки</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиВКамерахПропарки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Бригада</name>
    <type>
      <types>CatalogRef.алк_СменыШпон</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>КамераПропарки</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ОперацииПропарки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пропарщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Камеры</name>
    <attributes>
      <name>КамераСсылка</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаНачало</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлинаНаКонец</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаНачало</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПородаНаКонец</name>
      <type>
        <types>CatalogRef.Породы</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаНачало</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>СотрНаКонец</name>
      <type>
        <types>CatalogRef.Сорта</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаНачало</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрадацияНаКонец</name>
      <type>
        <types>CatalogRef.алк_ГрадацияПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаНачало</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеНаКонец</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаНачалоСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРазгрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>РазгрузилиОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоЗагрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЗазрузкиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрузкаОбъем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропарки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПропаркиПланНаСледующуюСмену</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаКонецСмены</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаДляДвижений</name>
    <attributes>
      <name>Камера</name>
      <type>
        <types>CatalogRef.алк_Штабели</types>
      </type>
    </attributes>
    <attributes>
      <name>Бригада</name>
      <type>
        <types>CatalogRef.алк_СменыШпон</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОжидаемое</name>
      <comment>Для контроля состояния камеры при записо документа</comment>
      <type>
        <types>EnumRef.алк_ОперацииПропарки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВыгрузкаИзКамерыГТО/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) И НЕ Параметры.Свойство("ПрограммноеСозданиеНаОсновании") Тогда  
		Сообщить("Ошибка! Документ можно создать только на основании загрузки в камеру ГТО.");
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		УстановитьСмену(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УстановитьСмену();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыгрузкиПриИзменении(Элемент)
	ЗаполнитьНормативРагрузкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыВыгрузки(Элемент.Имя); 
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; 
	
	УстановитьЗначениеДатыВыгрузки(Элемент.Имя);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедуры 

&НаСервере
Процедура УстановитьСмену() 
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		Если ПараметрыСменыПоТекущейДате = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьНормативРагрузкиНаСервере()
	
	Документы.алк_ВыгрузкаИзКамерыГТО.ЗаполнитьНормативРагрузки(Объект.Состав,Объект.ДатаНачалаВыгрузки,Объект.ДатаОкончанияВыгрузкиНорматив);
	
	//Если Объект.Состав.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаНачалаВыгрузки) Тогда   
	//	Объект.ДатаОкончанияВыгрузкиНорматив = "";   
	//	Возврат;
	//КонецЕсли;
	//
	//ГрадацияДокумента = Объект.Состав[0].Градация;
	//
	//Если НЕ ЗначениеЗаполнено(ГрадацияДокумента) Тогда  
	//	Объект.ДатаОкончанияВыгрузкиНорматив = "";
	//	Возврат;
	//КонецЕсли;
	//   	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	алк_ПериодыСезоновПропаркиСрезПоследних.Сезон
	//	|ПОМЕСТИТЬ ВТ_Сезон
	//	|ИЗ
	//	|	РегистрСведений.алк_ПериодыСезоновПропарки.СрезПоследних(&ДатаСреза, ) КАК алк_ПериодыСезоновПропаркиСрезПоследних
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	алк_НормативыПропаркиСрезПоследних.Градация,
	//	|	алк_НормативыПропаркиСрезПоследних.Сезон,
	//	|	алк_НормативыПропаркиСрезПоследних.НормативПропарки,
	//	|	алк_НормативыПропаркиСрезПоследних.НормативЗагрузки
	//	|ИЗ
	//	|	РегистрСведений.алк_НормативыПропарки.СрезПоследних(
	//	|			&ДатаСреза,
	//	|			Градация В (&ГрадацииДокумента)
	//	|				И Сезон В
	//	|					(ВЫБРАТЬ
	//	|						ВТ_Сезон.Сезон
	//	|					ИЗ
	//	|						ВТ_Сезон КАК ВТ_Сезон)) КАК алк_НормативыПропаркиСрезПоследних";
	//
	//Запрос.УстановитьПараметр("ГрадацииДокумента", ГрадацияДокумента);
	//Запрос.УстановитьПараметр("ДатаСреза", Объект.ДатаНачалаВыгрузки);
	//	
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл  
	//	Объект.ДатаОкончанияВыгрузкиНорматив = Объект.ДатаНачалаВыгрузки + Выборка.НормативЗагрузки * 3600;  
	//КонецЦикла;
	//	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьВыгрузкуПоЗагрузкеНаСервере()
	ПоказатьВопрос(Новый ОписаниеОповещения("ПередПерезаполнениемПоДокументуОснованию", ЭтотОбъект), НСтр("ru = 'Документ будет перезаполнен! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);	
КонецПроцедуры 

&НаКлиенте
Процедура ПередПерезаполнениемПоДокументуОснованию(Результат,ДопПараметры) Экспорт 
	Если Результат = Неопределено ИЛИ Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;   
	Объект.Состав.Очистить();
	ПерезаполнитьДокументПоОснованию(Объект.ДокументОснование);
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьДокументПоОснованию(ДокументОснование) 
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.Заполнить(ДокументОснование);
	ЗначениеВДанныеФормы(ТекущийОбъект, Объект);	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеДатыВыгрузки(ИмяЭлемента)   
	
	ПараметрыВремени = Новый Структура; 
	ПараметрыВремени.Вставить("ДатаВремя", ТекущаяДата()); 
	ПараметрыВремени.Вставить("ИмяЭлемента", ИмяЭлемента);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВводВремениЗавершено", ЭтотОбъект, ПараметрыВремени);

	ОткрытьФорму("Документ.алк_РапортПропарка.Форма.ФормаВводаВремени",ПараметрыВремени,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВводВремениЗавершено(РезультатЗакрытия, ДополнительныеПараметры) Экспорт  
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;	
	КонецЕсли;  
	
	ЭтаФорма.Объект[ДополнительныеПараметры.ИмяЭлемента] = РезультатЗакрытия; 
	
	ЗаполнитьНормативРагрузкиНаСервере();
		
КонецПроцедуры

#КонецОбласти

#Область Команды  

&НаКлиенте
Процедура ПерезаполнитьВыгрузкуПоЗагрузке(Команда)
	ПерезаполнитьВыгрузкуПоЗагрузкеНаСервере();
КонецПроцедуры 

#КонецОбласти
